In [1]:
import pandas as pd
s1=pd.Series([1,2,3,4,5])

In [2]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
type(s1)

pandas.core.series.Series

In [4]:
s2=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [5]:
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
s2.name="Sudarshan kapali"
s2

a    1
b    2
c    3
d    4
e    5
Name: Sudarshan kapali, dtype: int64

In [8]:
s3=pd.Series({'a':10,'b':20,'c':30})
s3

a    10
b    20
c    30
dtype: int64

In [9]:
s3.index.name = "index name"

In [10]:
s3

index name
a    10
b    20
c    30
dtype: int64

In [11]:
s3.name="sudarshan kapali"

In [12]:
s3

index name
a    10
b    20
c    30
Name: sudarshan kapali, dtype: int64

In [21]:
data = pd.read_csv('iris.csv')
#copy csv file and copy it into another file in the same directory

In [17]:
df1=pd.DataFrame({"Name":['Sudarshan','aman','Anuroop'],"Marks":[100,99,97]})
df1

        Name  Marks
0  Sudarshan    100
1       aman     99
2    Anuroop     97

In [18]:
df1.shape

(3, 2)

In [19]:
df1.head(1)

        Name  Marks
0  Sudarshan    100

In [20]:
df1.tail(1)

      Name  Marks
2  Anuroop     97

In [22]:
df1

        Name  Marks
0  Sudarshan    100
1       aman     99
2    Anuroop     97

In [24]:
data.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [25]:
data.shape

(150, 5)

In [26]:
data.iloc[0:3,0:2]
#for particular rows and columns 0.3 for rows and 0:2 for column
#it is exclusive

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

In [27]:
data.loc[5:10,('petal_length','petal_width')]
#using loc method is inclusive it include the last row specified
#inclusive 5-10
#exclusive 5-9

    petal_length  petal_width
5            1.7          0.4
6            1.4          0.3
7            1.5          0.2
8            1.4          0.2
9            1.5          0.1
10           1.5          0.2

In [29]:
data.drop('sepal_length',axis=1)

     sepal_width  petal_length  petal_width    species
0            3.5           1.4          0.2     setosa
1            3.0           1.4          0.2     setosa
2            3.2           1.3          0.2     setosa
3            3.1           1.5          0.2     setosa
4            3.6           1.4          0.2     setosa
..           ...           ...          ...        ...
145          3.0           5.2          2.3  virginica
146          2.5           5.0          1.9  virginica
147          3.0           5.2          2.0  virginica
148          3.4           5.4          2.3  virginica
149          3.0           5.1          1.8  virginica

[150 rows x 4 columns]

In [30]:
data.drop([3,4,5,6,7])

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
9             4.9          3.1           1.5          0.1     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[145 rows x 5 columns]

In [31]:
data.head(10)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [34]:
data.min()

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [35]:
data.max()

sepal_length          7.9
sepal_width           4.4
petal_length          6.9
petal_width           2.5
species         virginica
dtype: object